[
  
    {
    "title": "Hyperboria, Avalon, Biringan, and Other Hidden Cities of Myth and Spirit",
    "url": "/hyperboria/", 
    "description": "From the Greeks’ Hyperboria to Britain’s Avalon to the Philippines’ mysterious Biringan City, these legends all whisper of thresholds between the known world and the mystical.",
    "image": "https://i.imgur.com/epf68wl.png",
    "media": "conspiracy",
    "date": "2025-09-10 00:00:00 +0200"   
    },
  
    {
    "title": "The Wounded Healer - How Your Pain Can Become Your Greatest Power",
    "url": "/the-wounded-healer-how-your-pain-can-become-your-greatest-power/", 
    "description": "Every scar tells a story. Some are visible, traced across the skin. Others live deep within, invisible but no less real, the kind that ache when memories resurface. What if those wounds, instead of marking you as broken, were actually the source of your deepest strength?",
    "image": "https://i.imgur.com/WkoSZm3.png",
    "media": "healing",
    "date": "2025-08-16 00:00:00 +0200"   
    },
  
    {
    "title": "The Psychology of Prophecy - Why Humans Keep Seeking Signs from the Unseen",
    "url": "/the-psychology-of-prophecy-why-humans-keep-seeking-signs-from-the-unseen/", 
    "description": "From ancient oracles to modern-day horoscopes, why the human mind is wired to look beyond the visible.",
    "image": "https://i.imgur.com/dq7fwvS.png",
    "media": "spiritual",
    "date": "2025-08-15 00:00:00 +0200"   
    },
  
    {
    "title": "The Hidden History of Tarot - From Forbidden Symbolism to Mainstream Magic",
    "url": "/the-hidden-history-of-tarot-from-forbidden-symbolism-to-mainstream-magic/", 
    "description": "Today, tarot cards are everywhere — in bookstores, TikTok videos, therapy sessions, and even corporate team-building workshops. What was once the guarded practice of mystics has entered the mainstream, wrapped in colorful art and approachable language.",
    "image": "https://i.imgur.com/gfHwp7X.png",
    "media": "spiritual",
    "date": "2025-08-14 00:00:00 +0200"   
    },
  
    {
    "title": "The Forgotten Origins of Divination - How Ancient Seers Read the Future Without Tools",
    "url": "/the-forgotten-origins-of-divination-how-ancient-seers-read-the-future-without-tools/", 
    "description": "Across every culture and every century, human beings have looked to the horizon of time with the same pressing question - What comes next?",
    "image": "https://i.imgur.com/Xy1Takx.png",
    "media": "spiritual",
    "date": "2025-08-13 00:00:00 +0200"   
    },
  
    {
    "title": "The Emerald Tablet - Decoding the Most Mysterious Text in History",
    "url": "/the-emerald-tablet-decoding-the-most-mysterious-text-in-history/", 
    "description": "Hidden in the folds of history lies a text so brief you could read it in less than five minutes, yet so enigmatic it has fueled centuries of philosophical, spiritual, and scientific inquiry.",
    "image": "https://i.imgur.com/8AqOMO1.png",
    "media": "spiritual",
    "date": "2025-08-12 00:00:00 +0200"   
    },
  
    {
    "title": "The Divine Blueprint - How Sacred Geometry Shapes the Universe",
    "url": "/the-divine-blueprint-how-sacred-geometry-shapes-the-universe/", 
    "description": "From the spiral of a nautilus shell to the vast arms of a galaxy, nature seems to follow a mysterious design. Patterns repeat across scales — from microscopic atoms to cosmic superclusters — as if the universe were woven from a single underlying code.",
    "image": "https://i.imgur.com/Jc4XPNa.png",
    "media": "spiritual",
    "date": "2025-08-11 00:00:00 +0200"   
    },
  
    {
    "title": "The Chakra System Explained - Your Body’s Energy Map",
    "url": "/the-chakra-system-explained-your-bodys-energy-map/", 
    "description": "For thousands of years, spiritual traditions have spoken of subtle energy centers within the human body — invisible hubs that influence our physical health, emotional balance, and spiritual growth.",
    "image": "https://i.imgur.com/E5S163C.png",
    "media": "spiritual",
    "date": "2025-08-10 00:00:00 +0200"   
    },
  
    {
    "title": "The Archetype Behind the Icon - Why Certain Symbols Never Die",
    "url": "/the-archetype-behind-the-icon-why-certain-symbols-never-die/", 
    "description": "Some symbols never seem to fade. They survive empires, leap across continents, and reappear in new forms centuries later. The serpent eating its tail. The mother holding a child. The winged sun. The crowned ruler.",
    "image": "https://i.imgur.com/ECWE1y3.png",
    "media": "spiritual",
    "date": "2025-08-09 00:00:00 +0200"   
    },
  
    {
    "title": "Symbols That Changed Civilizations - From the Ankh to the Infinity Sign",
    "url": "/symbols-that-changed-civilizations-from-the-ankh-to-the-infinity-sign/", 
    "description": "Before humans wrote books, built skyscrapers, or launched satellites, we were already making symbols. A carved spiral, a painted animal on a cave wall, a mysterious glyph on a stone — these images carried meaning beyond words.",
    "image": "https://i.imgur.com/rwyB1Dh.png",
    "media": "spiritual",
    "date": "2025-08-08 00:00:00 +0200"   
    },
  
    {
    "title": "Shadow Work Prompts That Will Change How You See Yourself",
    "url": "/shadow-work-prompts-that-will-change-how-you-see-yourself/", 
    "description": "You have a side of yourself you rarely show the world. It’s the part that remembers every rejection, feels shame at the wrong moment, gets jealous of a friend’s success, or secretly wants things you’d never admit out loud.",
    "image": "https://i.imgur.com/75TBZV3.png",
    "media": "spiritual",
    "date": "2025-08-07 00:00:00 +0200"   
    },
  
    {
    "title": "Runes - The Ancient Alphabet That Spoke to the Gods",
    "url": "/runes-the-ancient-alphabet-that-spoke-to-the-gods/", 
    "description": "Long before alphabets became mere tools for communication, some were believed to hold inherent magical power. Among the most mysterious of these is the runic alphabet — a system of angular characters carved into wood, stone, and bone across the Germanic and Norse worlds.",
    "image": "https://i.imgur.com/iZPXdlc.png",
    "media": "spiritual",
    "date": "2025-08-06 00:00:00 +0200"   
    },
  
    {
    "title": "Myths as Mirrors - Finding Yourself in Archetypal Stories",
    "url": "/myths-as-mirrors-finding-yourself-in-archetypal-stories/", 
    "description": "We don’t live in the age of Zeus, Odin, or Anansi anymore — or do we? While the gods of old may have left the temples, their stories still walk among us, disguised in our books, films, and even our personal struggles.",
    "image": "https://i.imgur.com/Z1yPPRO.jpeg",
    "media": "spiritual",
    "date": "2025-08-05 00:00:00 +0200"   
    },
  
    {
    "title": "Meditation for People Who Can’t Sit Still",
    "url": "/meditation-for-people-who-cant-sit-still/", 
    "description": "For many people, the word meditation brings to mind serene monks sitting motionless on mountain tops or yoga instructors in perfect lotus pose. That’s great — for them. But what about the rest of us?",
    "image": "https://i.imgur.com/xSHQu7k.png",
    "media": "healing",
    "date": "2025-08-04 00:00:00 +0200"   
    },
  
    {
    "title": "Ancient healing practices that still work today",
    "url": "/ancient-healing-practices-that-still-work-today/", 
    "description": "Thousands of years before hospitals, pharmaceuticals, and modern medical devices, humans turned to the natural world, spiritual traditions, and community wisdom to heal. Some of these ancient methods might sound mystical, but modern science is now confirming what our ancestors already knew - many of these practices are remarkably effective.",
    "image": "https://i.imgur.com/OOtyMFK.png",
    "media": "healing",
    "date": "2025-08-03 00:00:00 +0200"   
    },
  
    {
    "title": "Manifestation Myths - Why Your Vision Board Isn’t Enough",
    "url": "/manifestation-myths-why-your-vision-board-isnt-enough/", 
    "description": "Manifestation has exploded into mainstream culture. Between TikTok affirmations, Instagram-worthy vision boards, and bestsellers promising ask, believe, receive, it sounds simple enough - picture your dream life and watch it materialize.",
    "image": "https://i.imgur.com/hQh9W4g.png",
    "media": "spiritual",
    "date": "2025-08-02 00:00:00 +0200"   
    },
  
    {
    "title": "From Breakdown to Breakthrough - The Stages of Deep Personal Growth",
    "url": "/from-breakdown-to-breakthrough-the-stages-of-deep-personal-growth/", 
    "description": "Why your hardest moments may be the doorway to your most powerful? We often think of growth as a gentle unfolding — like a flower blooming in sunlight. But real, deep personal growth? It’s often messier, rawer, and far more disruptive.transformation.",
    "image": "https://i.imgur.com/yvHImQu.png",
    "media": "healing",
    "date": "2025-08-01 00:00:00 +0200"   
    },
  
    {
    "title": "Forest Bathing - The Healing Science of Simply Being Among Trees",
    "url": "/forest-bathing-the-healing-science-of-simply-being-among-trees/", 
    "description": "You’ve probably heard the phrase forest bathing floating around in wellness circles. The name might conjure up images of soaking in a tub surrounded by pine branches, but the reality is simpler — and more powerful.",
    "image": "https://i.imgur.com/LlMDnWR.png",
    "media": "healing",
    "date": "2025-07-31 00:00:00 +0200"   
    },
  
    {
    "title": "Esotericism Explained - The Hidden Thread Connecting Mystical Traditions",
    "url": "/esotericism-explained-the-hidden-thread-connecting-mystical-traditions/", 
    "description": "From the temples of ancient Egypt to modern yoga studios, from medieval alchemists’ laboratories to secret Masonic lodges — there exists a **hidden stream of wisdom** that flows beneath history’s surface. It doesn’t always show up in official doctrines or religious creeds. Instead, it whispers in symbols, rituals, and layered teachings, accessible only to those willing to look deeper.",
    "image": "https://i.imgur.com/5QPNmkH.png",
    "media": "spiritual",
    "date": "2025-07-30 00:00:00 +0200"   
    },
  
    {
    "title": "Conspiracy Iceberg",
    "url": "/conspiracy-iceberg/", 
    "description": "Here’s a visual example of a classic Conspiracy Theory Iceberg — a meme format that arranges theories by obscurity and perceived extremity, with the more widely known at the top and increasingly fringe or bizarre ones deeper down.",
    "image": "https://i.imgur.com/AVwyqn6.png",
    "media": "conspiracy",
    "date": "2025-07-29 00:00:00 +0200"   
    },
  
    {
    "title": "Cats - Nature’s Hidden Healers",
    "url": "/cats-natures-hidden-healers/", 
    "description": "For centuries, ancient civilizations like the Egyptians revered cats, treating them as sacred beings with mysterious powers. Today, modern science is uncovering what those cultures seemed to know instinctively - cats are far more than just cuddly companions.",
    "image": "https://i.imgur.com/GwA7XYX.png",
    "media": "healing",
    "date": "2025-07-28 00:00:00 +0200"   
    },
  
    {
    "title": "From Scarcity to Abundance - Rewiring the Way You See the World",
    "url": "/from-scarcity-to-abundance-rewiring-the-way-you-see-the-world/", 
    "description": "Imagine two people standing side by side, looking at the same sunset. One sees beauty, gratitude, and possibility. The other sees nothing but the reminder that the day is over, and time is running out.",
    "image": "https://i.imgur.com/6BnKY3Y.png",
    "media": "healing",
    "date": "2025-07-27 00:00:00 +0200"   
    },
  
    {
    "title": "How Energy Healing Works — and Why Science is Catching Up",
    "url": "/how-energy-healing-works-and-why-science-is-catching-up/", 
    "description": "For centuries, the idea that human beings could influence health through unseen energy fields was dismissed in much of the Western world as superstition. Yet across cultures — from the Ayurvedic prana of India to the qi of Traditional Chinese Medicine — energy has always been considered central to life.",
    "image": "https://i.imgur.com/I0uhiSC.png",
    "media": "healing",
    "date": "2025-07-26 00:00:00 +0200"   
    }
  
]
